from telebot import types
from keyboards import get_main_menu

def setup_handlers(bot):
    user_states = {}

    @bot.message_handler(commands=['start'])
    def start_command(message):
        user_states[message.chat.id] = {'mode': 'menu'}
        bot.send_message(
            message.chat.id,
            'Привет 🌟 Давай попрактикуемся в английском языке! '
            'Ты можешь тренироваться в удобном для себя темпе 🚀. '
            'Используй тренажёр как конструктор — '
            'создавай свою собственную базу слов 🧩! '
            'Для этого используй инструменты: '
            'добавить слово 💬, '
            'удалить слово 🗑️. '
            'Готов? Тогда вперёд — начнём прямо сейчас! 💪🔥',
            reply_markup=get_main_menu() # кнопки внизу
        )


